{"inkVersion":20,"root":[[{"->":"Intro"},["done",{"#f":5,"#n":"g-0"}],null],"done",{"Intro":[["ev","str","^Black","/str",{"x()":"ChangeBackground","exArgs":1},"out","/ev","\n","^Once upon a time...","\n","^On Christmas eve...","\n","ev","str","^JohnsRoom","/str",{"x()":"ChangeBackground","exArgs":1},"out","/ev","\n","^In a town called WinterPlains, there was a boy in his room, his name was John.","\n","^Dressed in his warm pajamas and bundled up with his winter blanket, he spent his time alone, playing or watching the same movies that were always broadcasted at this time of the year. Movies that made no sense in his opinion, where problems were solved because of the \"magic\" of Christmas, he didn't believe in that, he knew that life wasn't like that.","\n","^These dates meant nothing to him, if we put together his issues to socialize with the poor relationship he has with his family he had nothing left to do but to lock himself in his own room, inhibiting himself from reality while killing time.","\n","^This Christmas was especially problematic, his father had been called to transfer to another city for his job. This did not please his mother, it was his hometown, where she had lived all his life. She also needed to take care of her mother, who lived 5 minutes away and needed some care. The idea of moving didn't bother John, he had nothing here, no one would miss him (except maybe his grandmother).","\n",["^I think I should take a shower... - John said, after so many days in his room, going out only to eat or to help his parents with household chores, he had lost count of the days, and he didn't even know how long he hadn't showered.","\n","^He grabbed some clothes and went straight to the bathroom without greeting anyone","\n",[["ev",{"^->":"Intro.0.g-0.4.0.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":18},{"s":["^Brush your teeth",{"->":"$r","var":true},null]}],["ev",{"^->":"Intro.0.g-0.4.1.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-1","flg":18},{"s":["^Take a shower",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"Intro.0.g-0.4.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.0.s"},[{"#n":"$r2"}],"\n",{"->":"BrushTeeth"},{"#f":5}],"c-1":["ev",{"^->":"Intro.0.g-0.4.c-1.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.1.s"},[{"#n":"$r2"}],"\n",{"->":"TakeShower"},{"#f":5}]}],{"#f":5,"#n":"g-0"}],null],{"#f":1}],"BrushTeeth":["ev","str","^Bathroom","/str",{"x()":"ChangeBackground","exArgs":1},"out","/ev","\n","^John took the toothbrush, and unfortunately he looked at his reflection.","\n","^His hair was disheveled, he had dark circles under his eyes, and he didn't even have his pajamas on. Seeing his reflection brought a quick thought, he was wasting time in his room. He had had that thought before, so many times... he dismissed it as quickly as the other times. He was alone, his family didn't care about his social problems, but... what could he do?","\n","^He managed to distract his mind and set out to take a hot shower. This time his reflection did not displease him, he had dressed in his favorite clothes and with his hair well combed he gained some confidence to face the day.","\n",{"->":"AfterTakeShower"},{"#f":1}],"TakeShower":["ev","str","^Bathroom","/str",{"x()":"ChangeBackground","exArgs":1},"out","/ev","\n","^John quickly went to take a hot shower, he wanted to feel clean as soon as possible. He would worry about his teeth later.","\n",{"->":"AfterTakeShower"},{"#f":1}],"AfterTakeShower":[["ev","str","^Kitchen","/str",{"x()":"ChangeBackground","exArgs":1},"out","/ev","\n","^He went downstairs to get something to eat, he didn't even know what time it was. Through the kitchen window, he could see the sun setting. He also saw his mother, who smiled a little smile at the sight of him, although there was some concern in her eyes.","\n","ev","str","^John","/str","str","^Left","/str",{"x()":"ShowCharacter","exArgs":2},"out","/ev","\n","ev","str","^Mother","/str","str","^Right","/str",{"x()":"ShowCharacter","exArgs":2},"out","/ev","\n",["^Hello, sweetheart! Looks like you're finally out of the cave! I almost thought I'd have to get you out myself, so we could celebrate Christmas Eve together - John didn't like that comment very much, he wasn't locked up because he wanted to be.","\n",["^Hi, looks like it's late.","\n",["^Of course it is! I'm making dinner, you know I'll be a few hours, but thank goodness you're here. I need you to go get some things, I'm missing ingredients for the recipe and your father is out.","\n",[["ev",{"^->":"AfterTakeShower.0.g-0.g-1.g-2.2.0.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":18},{"s":["^Reply annoyed",{"->":"$r","var":true},null]}],["ev",{"^->":"AfterTakeShower.0.g-0.g-1.g-2.2.1.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-1","flg":18},{"s":["^Be kind, she is going through a hard time too.",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"AfterTakeShower.0.g-0.g-1.g-2.2.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.0.s"},[{"#n":"$r2"}],"\n",{"->":"AnsweredRudeToYourMother"},{"#f":5}],"c-1":["ev",{"^->":"AfterTakeShower.0.g-0.g-1.g-2.2.c-1.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.1.s"},[{"#n":"$r2"}],"\n",{"->":"AnswredKindToYourMother"},{"#f":5}]}],{"#f":5,"#n":"g-2"}],{"#f":5,"#n":"g-1"}],{"#f":5,"#n":"g-0"}],null],{"#f":1}],"AnswredKindToYourMother":[["ev",false,"/ev",{"VAR=":"rudeToYourMother","re":true},["^Okay mom, tell me what you need","\n",["^I should buy some gifts too, it's Christmas Eve anyway, and I haven't had time to buy anything. - John thought - Well, I have had time, I just haven't taken advantage of it.","\n",{"->":"RoadToShop"},{"#f":5,"#n":"g-1"}],{"#f":5,"#n":"g-0"}],null],{"#f":1}],"AnsweredRudeToYourMother":[["ev",true,"/ev",{"VAR=":"rudeToYourMother","re":true},["^Can't you go by yourself? Besides, you could call dad and tell him","\n",["^Yes, but you need to go out. Being locked up for so long is not good, besides, this way you can buy our presents. Because you haven't bought them, have you?","\n",["^She's right... I didn't even know it was Christmas Eve... I have something saved up, I should buy something - John thought - Okay, tell me what you need.","\n","^She took out a note she had already prepared and gave it to John with the money. - Thanks sweetie, at least at dinner we can spend some time together...","\n",{"->":"RoadToShop"},{"#f":5,"#n":"g-2"}],{"#f":5,"#n":"g-1"}],{"#f":5,"#n":"g-0"}],null],{"#f":1}],"RoadToShop":["^John went to the entrance of his house, through the window he saw that it was raining, he would have to go with an umbrella","\n","^He hated umbrellas, in WinterPlains it was very windy and that made it difficult for him to go with umbrellas. Luckily for him, the rain was not accompanied by an excessive wind, so he took his black umbrella and opened the door.","\n","ev","str","^Neighborhood","/str",{"x()":"ChangeBackground","exArgs":1},"out","/ev","\n","^The winter cold suddenly attacked him, getting into his clothes to freeze his skin, he should have wrapped up more. He resisted the cold and decided to continue on his way to the store, he did not like the idea of going back to search through his closet, full of messy or dirty clothes looking for something better than his sweatshirt.","\n","^The neighborhood was decorated with Christmas lights arranged in each house, some with more picturesque forms such as Santa Claus entering through their chimneys, sleighs with reindeer... others were simpler, simply illuminating the facades. The children created snowmen or some took sleds to slide through the snow. They didn't seem to care about the rain, they laughed non-stop as their clothes were covered in snow and rain.","\n","^There were people removing the snow from their driveways, others removing it from their cars... The traffic was not heavy in the neighborhood, due to the weather it was better not to drive. Some people ran to buy last minute gifts.","\n","^On his way to the store he saw a young girl, dressed in a business suit with a long coat, as she sheltered from the rain under the roof of a bus shelter. She seemed quite worried.","\n","^Suddenly her eyes fell on my umbrella, it seemed that she wanted to come closer and say something, but after a moment she looked away.","\n",[["ev",{"^->":"RoadToShop.22.0.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":18},{"s":["^Ask if she needs anything",{"->":"$r","var":true},null]}],["ev",{"^->":"RoadToShop.22.1.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-1","flg":18},{"s":["^Ignore it",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"RoadToShop.22.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.0.s"},[{"#n":"$r2"}],"\n",{"->":"AskedTheGirl"},{"#f":5}],"c-1":["ev",{"^->":"RoadToShop.22.c-1.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.1.s"},[{"#n":"$r2"}],"\n",{"->":"IgnoreTheGirl"},{"#f":5}]}],{"#f":1}],"IgnoreTheGirl":["^John passed by without looking at the girl. He didn't know her at all, why should he approach her and ask?","\n","^However, he looked back, John caught her looking at her umbrella again as he walked away but decided to continue towards the store.","\n",{"->":"TowardsTheStore"},{"#f":1}],"AskedTheGirl":[["^A feeling of curiosity emerges from John, the girl seemed concerned, and it didn't hurt to ask.","\n","^John approached the girl, who looked back at him as he approached.","\n",["^Hello, is something wrong? - asked John.","\n",["^Well... I have an important meeting for my work, but the rain has caught me by surprise and I don't have an umbrella. I can't show up all wet and messy - It seemed like this was significant to her.","\n",["^Why don't you wait until the rain stops? It doesn't look like it has much left - John replied.","\n",["^That's what I'm doing, but I don't have that much time and I can't afford to be late either.","\n",["^Well maybe I could...","\n",[["ev",{"^->":"AskedTheGirl.0.g-0.g-1.g-2.g-3.g-4.2.0.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":18},{"s":["^Lend him your umbrella",{"->":"$r","var":true},null]}],["ev",{"^->":"AskedTheGirl.0.g-0.g-1.g-2.g-3.g-4.2.1.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-1","flg":18},{"s":["^Tell her to wait",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"AskedTheGirl.0.g-0.g-1.g-2.g-3.g-4.2.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.0.s"},[{"#n":"$r2"}],"\n",{"->":"LendYourUmbrella"},{"#f":5}],"c-1":["ev",{"^->":"AskedTheGirl.0.g-0.g-1.g-2.g-3.g-4.2.c-1.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.1.s"},[{"#n":"$r2"}],"\n",{"->":"TellTheGirlToWait"},{"#f":5}]}],{"#f":5,"#n":"g-4"}],{"#f":5,"#n":"g-3"}],{"#f":5,"#n":"g-2"}],{"#f":5,"#n":"g-1"}],{"#f":5,"#n":"g-0"}],null],{"#f":1}],"LendYourUmbrella":[["ev",true,"/ev",{"VAR=":"helpedTheGirl","re":true},"^John looked at his umbrella, a simple black umbrella just big enough for one person. It was a few years old now, he didn't mind giving it away, at least he had a hood to hide from the rain. It also seemed important for the girl to arrive on time and dry for the meeting.","\n",["^Here, you can keep it. You look like you need it more than I do.","\n",["^Do you really? Thank you! I don't know how to thank you... If you tell me your address, I promise to return it! - Said the girl, who kept thanking John while she was running away towards the meeting.","\n","^John felt some happiness for having helped the girl, a feeling that slowly went away as he got wet from the rain, since he didn't have his umbrella now. He had helped the girl, but did it really matter? He would never see her again, and now he would have to buy a new umbrella.","\n",{"->":"TowardsTheStore"},{"#f":5,"#n":"g-1"}],{"#f":5,"#n":"g-0"}],null],{"#f":1}],"TellTheGirlToWait":[[["^No, I'm sure it will stop raining soon, and she will be able to go to the meeting. Besides, I'm sure someone else can help her, I don't want to get wet either - John thought.","\n",["^Don't worry, the way it's raining I'm sure it will stop raining soon.","\n",["^Well... thanks for asking anyway - Replied the girl, who seemed sadder now.","\n","^John said goodbye as he walked away from the girl, dry under his umbrella.","\n","^However, he looked back, John caught her looking at her umbrella again as he walked away but decided to continue towards the store.","\n",{"->":"TowardsTheStore"},{"#f":5,"#n":"g-2"}],{"#f":5,"#n":"g-1"}],{"#f":5,"#n":"g-0"}],null],{"#f":1}],"TowardsTheStore":[["^John walked for a few minutes until he reached the store, it seemed that it would not stop raining.","\n","ev",{"VAR?":"helpedTheGirl"},"/ev",[{"->":".^.b","c":true},{"b":["^ John were glad you gave her umbrella to the girl, she could not have made it to the meeting without her help.",{"->":".^.^.^.6"},null]}],"nop","\n","ev",{"VAR?":"helpedTheGirl"},"!",{"CNT?":"AskedTheGirl"},"&&","/ev",[{"->":".^.b","c":true},{"b":["^ A small feeling of guilt came over John, it seemed that the girl would not be able to make it to the meeting because of the rain. But someone else must have helped her, right?",{"->":".^.^.^.15"},null]}],"nop","\n","ev","str","^OutsideShop","/str",{"x()":"ChangeBackground","exArgs":1},"out","/ev","\n","^John arrived at the store, as always at this time of year, there was a line to get in. As a counterpart to all the people lining up to buy gifts or food for the holidays, near the entrance were homeless people. They stood there these days, hoping that someone would feel compassionate enough to give them some money.","\n","^He didn't look at the homeless and stood in line. John moved slowly, there seemed to be more people than he thought.","\n","^The minutes passed, advancing little by little. After waiting a while John almost reached the entrance, next to him sat a homeless person. He was not very warm, he must have been freezing. He was a gray-haired man, quite thin, a reflection of not eating for days, he looked tired.","\n","^Suddenly the man looked at him, his eyes expressing nothing but weariness.","\n",["^Do you have any money you can give me? Please... - begged the homeless man.","\n","^The line of people moved forward, leaving John's path clear to enter the store.","\n",["^I'm sorry, I don't have any money to give you.","\n","^The man kept looking him in the eye, he knew it was a lie. He looked down and wrapped his arms around himself, trying to protect himself from the cold. To the homeless man, John was just one more, one of many who ignored him or lied just to avoid giving him some money.","\n","^John entered the store, his mind focused on the homeless man. Feeling guilty for having lied to him. He did have money, but he had just enough for his mother's shopping and to buy Christmas presents.","\n",{"->":"InTheStore"},{"#f":5,"#n":"g-1"}],{"#f":5,"#n":"g-0"}],null],{"#f":1}],"InTheStore":["ev","str","^Shop","/str",{"x()":"ChangeBackground","exArgs":1},"out","/ev","\n","^John walked around the store, a supermarket divided into sections. There was food, video games, toys, books....","\n","^He decided to go directly to buy the ingredients for his mother. As he walked through the store, crossing things off the list, he kept thinking about the homeless man.","\n",[["ev",{"^->":"InTheStore.12.0.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":18},{"s":["^I could buy something for him",{"->":"$r","var":true},null]}],["ev",{"^->":"InTheStore.12.1.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-1","flg":18},{"s":["^Discard the thought",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"InTheStore.12.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.0.s"},[{"#n":"$r2"}],"\n",{"->":"BuySomethingForTheHomeless"},{"#f":5}],"c-1":["ev",{"^->":"InTheStore.12.c-1.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.1.s"},[{"#n":"$r2"}],"\n","^Distracting his mind, John decide to think about what he should buy for her parents.","\n",{"->":"BuyGifts"},{"#f":5}]}],{"#f":1}],"BuySomethingForTheHomeless":["ev",true,"/ev",{"VAR=":"helpedTheHomeless","re":true},"^At the end the feeling of guilt for having lied to the homeless man invaded him, John thought about what he could do to help him. It seems that buying him some food was the best option, since he had just enough money, John couldn't buy the gifts he had thought of, but he would look around the store for something more affordable to give to his parents.","\n",{"->":"BuyGifts"},{"#f":1}],"BuyGifts":["^He browsed the store looking for gifts for her parents. John didn't know them very well, even though they lived together he didn't talk to them much and hardly saw them because of their jobs.","\n","ev",{"VAR?":"helpedTheHomeless"},"/ev",[{"->":".^.b","c":true},{"b":["^ Since he didn't have much money from helping the homeless, he decided to pick something to spend time together. He remembered years before, when they played many board games together. They were happy memories. He went to the board game section and took a quick look. Any of them would do, he just wanted an excuse to be together. John saw a shelf where the best-selling board games were displayed, and without thinking, he picked one at random.",{"->":".^.^.^.6"},null]}],"nop","\n","ev",{"VAR?":"helpedTheHomeless"},"!","/ev",[{"->":".^.b","c":true},{"b":["^ He took a quick tour of the store, thinking about what he could give his parents. He spent some time searching but could not find a good gift, in the end, tired of searching, he chose a couple of things from the bestseller shelves. He wasn't sure his parents would like the gifts.",{"->":".^.^.^.13"},null]}],"nop","\n",{"->":"BackHome"},{"#f":1}],"BackHome":[["ev","str","^Neighborhood","/str",{"x()":"ChangeBackground","exArgs":1},"out","/ev","\n","^Once the gifts and things on the list were paid for ","ev",{"VAR?":"helpedTheHomeless"},"/ev",[{"->":".^.b","c":true},{"b":["^ (and after feeding the homeless man)",{"->":".^.^.^.13"},null]}],"nop","^, he headed back home. On the way, a girl spoke to him.","\n",["^Excuse me, do you want a match?","\n",["^Match? What would you want it for?","\n",["^Please, no one has bought me matches all day... I need money","\n","^John noticed the girl, she was small, blonde with curls that covered her neck, she was only wearing one shoe and her clothes didn't seem to warm her too much.","\n",[["ev",{"^->":"BackHome.0.g-0.g-1.g-2.4.0.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":18},{"s":["^Buy matches",{"->":"$r","var":true},null]}],["ev",{"^->":"BackHome.0.g-0.g-1.g-2.4.1.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-1","flg":18},{"s":["^Dont buy matches",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"BackHome.0.g-0.g-1.g-2.4.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.0.s"},[{"#n":"$r2"}],"\n",{"->":"BuyMatches"},{"#f":5}],"c-1":["ev",{"^->":"BackHome.0.g-0.g-1.g-2.4.c-1.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.1.s"},[{"#n":"$r2"}],"\n",{"->":"DontBuyMatches"},{"#f":5}]}],{"#f":5,"#n":"g-2"}],{"#f":5,"#n":"g-1"}],{"#f":5,"#n":"g-0"}],null],{"#f":1}],"BuyMatches":[["ev",true,"/ev",{"VAR=":"buyiedMatchess","re":true},"^John felt compassion for the girl, she was alone selling matches to have money for Christmas. She rummaged through her pockets, hoping to find something to give the girl.","\n","^Luckily, he had some loose change in her back pocket, he didn't even remember that he had them.","\n",["^Here, it's all I can give you - John said","\n","^The girl's expression brightened - Thank you! At least now my father won't scold me, I'm sure I have time to sell matches to someone else. Merry Christmas!","\n","^John wished her a Merry Christmas too, and the girl walked away happy. John also felt better having helped the girl.","\n",{"->":"GrandmaCalls"},{"#f":5,"#n":"g-0"}],null],{"#f":1}],"DontBuyMatches":[["^John remembered that he spent his money buying gifts for his parents. - I'm sorry, I have nothing to give you for the matches","\n",["^Anything will do, I can't get home without selling anything. Please - Said the girl","\n","^John apologized again and kept walking. The girl didn't move, she sat down and lit some matches. Surely to warm up, she seemed sad","\n","^John felt a pang of guilt.","\n",{"->":"GrandmaCalls"},{"#f":5,"#n":"g-0"}],null],{"#f":1}],"GrandmaCalls":["^On the way home, John's phone vibrated, he reached into his pocket and took out the phone. It was a message from his grandmother, he said \"Merry Christmas darling! You could come see your grandmother on these dates... I haven't seen you in a long time\"","\n","^True, John hadn't even thought about her... Suddenly he felt terrible about himself for having locked himself away for so long, disconnected from everything else.","\n",[["ev",{"^->":"GrandmaCalls.4.0.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":18},{"s":["^Go to see her",{"->":"$r","var":true},null]}],["ev",{"^->":"GrandmaCalls.4.1.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-1","flg":18},{"s":["^Go home",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"GrandmaCalls.4.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.0.s"},[{"#n":"$r2"}],"\n",{"->":"SeeYourGrandma"},{"#f":5}],"c-1":["ev",{"^->":"GrandmaCalls.4.c-1.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.1.s"},[{"#n":"$r2"}],"\n",{"->":"AfterGrandma"},{"#f":5}]}],{"#f":1}],"SeeYourGrandma":[["ev",true,"/ev",{"VAR=":"sawYourGrandma","re":true},"^John looked at the time on his cell phone, it was late, but he would have time to go see his grandmother and take the things to his mother later. Luckily, his grandmother lived close to home. John send her a message.","\n",["^\"You're right grandma, I'll be there in a few minutes, I love you\"","\n","^He walked for a few minutes until he finally arrived at his grandmother's house. John knocked on the door and his grandmother took a few minutes to open. She walked slowly and had a hard time getting up, like anyone his age. When the door opened, her grandmother looked at him, and he could see how happy she was to have visited her.","\n",["^Hello darling! Come in, come in, I've made cookies, they're too many for me.","\n","ev","str","^GrandmotherHouse","/str",{"x()":"ChangeBackground","exArgs":1},"out","/ev","\n","^John entered her grandmother's house, it had been a while since he had visited her. But everything remained the same, he sat in the kitchen while she took out the cookies and asked him about school or her friends.","\n","^John didn't like that subject, he had been missing classes lately. He hadn't managed to make friends either, he didn't consider himself interesting, and he thought he was bothering others, so he distanced himself from his classmates.","\n","^But he couldn't tell his grandmother that, she would worry too much about him, so he told her a little lie and tried to divert the subject.","\n",["^It almost seems that it is not Christmas in this house, you do not even have the Christmas tree on, grandma.","\n",["^I know darling, lately I haven't had the strength to start decorating the house and your mother is busy enough to bother her with it. - She seemed a little sad about that, his grandmother had always loved decorating the house for Christmas","\n",[["ev",{"^->":"SeeYourGrandma.0.g-0.g-1.g-2.g-3.2.0.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":18},{"s":["^I could help you decorate the Christmas tree, it's not too late",{"->":"$r","var":true},null]}],["ev",{"^->":"SeeYourGrandma.0.g-0.g-1.g-2.g-3.2.1.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-1","flg":18},{"s":["^It's late, I should go home",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"SeeYourGrandma.0.g-0.g-1.g-2.g-3.2.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.0.s"},[{"#n":"$r2"}],"\n",{"->":"HelpYourGrandma"},{"#f":5}],"c-1":["ev",{"^->":"SeeYourGrandma.0.g-0.g-1.g-2.g-3.2.c-1.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.1.s"},[{"#n":"$r2"}],"\n",{"->":"AfterGrandma"},{"#f":5}]}],{"#f":5,"#n":"g-3"}],{"#f":5,"#n":"g-2"}],{"#f":5,"#n":"g-1"}],{"#f":5,"#n":"g-0"}],null],{"#f":1}],"HelpYourGrandma":[["ev",true,"/ev",{"VAR=":"helpedGrandma","re":true},["^Really, honey? That would be great. But didn't you have to leave?","\n",["^Don't worry, I'm sure we'll have time to decorate the Christmas tree. - Said John","\n","^His grandmother quickly went to get the things to decorate the tree, she seemed more cheerful now. She came back a few minutes later with a big box full of decorations.","\n","ev","str","^GrandmotherHouseDecorated","/str",{"x()":"ChangeBackground","exArgs":1},"out","/ev","\n","^They spent some time decorating the house, putting the Christmas balls on the tree, they also placed strings of lights around the tree that made the room sparkle. The whole house seemed much livelier now, and so did his grandmother. John was grateful that he had stayed to spend time with her. Sometimes he thought that he didn't spend enough time with his grandmother, someday she wouldn't be around, and he would regret not visiting her enough.","\n","^Once they finished, John said goodbye to his grandmother.","\n",["^We will see each other soon grandma, next time I will come with my parents, so we can all be together.","\n",["^I wish I could come myself to visit you, but I'm getting old now.","\n",["^Don't worry grandma, Merry Christmas","\n",["^Merry Christmas sweetie - His grandmother hugged him then put something in her pocket - Thank you for visiting me.","\n","^John said goodbye and left his grandmother's house, he put his hand in his pocket and, as he expected, his grandmother had given him 10 dollars. She always gave him 10 dollars when he visited her, as a child it seemed like a fortune to John, and now he appreciated the gesture more than the money.","\n",{"->":"AfterGrandma"},{"#f":5,"#n":"g-5"}],{"#f":5,"#n":"g-4"}],{"#f":5,"#n":"g-3"}],{"#f":5,"#n":"g-2"}],{"#f":5,"#n":"g-1"}],{"#f":5,"#n":"g-0"}],null],{"#f":1}],"AfterGrandma":["ev","str","^Neighborhood","/str",{"x()":"ChangeBackground","exArgs":1},"out","/ev","\n","ev",{"VAR?":"sawYourGrandma"},"/ev",[{"->":".^.b","c":true},{"b":["^ ",{"->":"EncounterKids"},{"->":".^.^.^.12"},null]}],"nop","\n","ev",{"VAR?":"sawYourGrandma"},"!","/ev",[{"->":".^.b","c":true},{"b":["^ John didn't feel like going to see her, although he felt bad for not having thought of her in all this time. He sent her a message. - I'm sorry grandma, I have to deliver some things to mom. Merry Christmas, I promise I'll come see you the next day. I love you - John headed for home, it wouldn't be more than a few minutes. He spent the whole way thinking about his grandmother - I should have visited her... She's old and can hardly leave the house, I haven't seen her in too long - He thought. While the feeling of guilt grew, John arrived home.",{"->":".^.^.^.19"},null]}],"nop","\n",{"->":"ArriveHome"},{"#f":1}],"EncounterKids":["^John was on his way home, even though it was a little late, there were still people on the streets. It wouldn't be long before he got home. Suddenly as he was walking something hit him in the head, it didn't hurt, but it was very cold. They had thrown a snowball at him. John looked around and saw a couple of boys about his age looking at him laughing. Suddenly he felt terrible, were they laughing at him? Why had they thrown the snowball at him? Did they want to tease him?","\n",[["ev",{"^->":"EncounterKids.2.0.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":18},{"s":["^Thow a snowball at them",{"->":"$r","var":true},null]}],["ev",{"^->":"EncounterKids.2.1.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-1","flg":18},{"s":["^Face them",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"EncounterKids.2.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.0.s"},[{"#n":"$r2"}],"\n",{"->":"SnowballThem"},{"#f":5}],"c-1":["ev",{"^->":"EncounterKids.2.c-1.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.1.s"},[{"#n":"$r2"}],"\n",{"->":"FaceThem"},{"#f":5}]}],{"#f":1}],"SnowballThem":["ev",true,"/ev",{"VAR=":"playedWithKids","re":true},"^John put the bags on the floor. The boys looked at him strangely. He bent down and took a piece of snow in his hands, shaping it with his hands, John prepared his snowball. The boys realized what he was doing and smiled, it looked like they wanted him to throw the snowball at them.","\n","^Before the boys could form more snowballs, John threw his snowball at them, hitting one of them in the head. The boys didn't stand still, they started throwing more snowballs at him while John was preparing, dodging and throwing snowballs at the boys.","\n","^When he realized he was smiling, tired, but happy. After a few exchanges of snowballs, John gave up, after all it was two against one.","\n","^He grabbed his stuff and the boys approached him. Apparently they were from his own school, he didn't know almost anyone, so they didn't look familiar to John. They talked for a while and seemed to like him, they even said that he should be with them when classes started again, he said goodbye to the boys and continued on his way home.","\n",{"->":"ArriveHome"},{"#f":1}],"FaceThem":[["^John pulled up some courage and looked at the boys.","\n",["^What are you doing?! Why did you throw a snowball at me?! - shouted John","\n","^The boys looked at him in surprise, ducked their heads and apologized.","\n",["^Sorry, we just wanted to play. We didn't think you were going to react like that, we should have asked first - Said one of the boys.","\n","^John was embarrassed to have reacted that way, maybe he had overreacted a little. - I'm sorry I yelled at you, but you shouldn't be throwing snowballs at people - John picked up his bags and continued home, too embarrassed to stay and talk to the boys.","\n",{"->":"ArriveHome"},{"#f":5,"#n":"g-1"}],{"#f":5,"#n":"g-0"}],null],{"#f":1}],"ArriveHome":[["ev","str","^Kitchen","/str",{"x()":"ChangeBackground","exArgs":1},"out","/ev","\n","^John finally got home.","\n","ev",{"VAR?":"sawYourGrandma"},"/ev",[{"->":".^.b","c":true},{"b":["^ - Thank goodness you're home, it took you so long, you know? It's almost time for dinner, tell me you brought what I asked for - Said his mother.",{"->":".^.^.^.14"},null]}],"nop","\n","ev",{"VAR?":"sawYourGrandma"},"/ev",[{"->":".^.b","c":true},{"b":["^ - Sorry mom, I brought your stuff. I was late because I went to see grandma.",{"->":".^.^.^.20"},null]}],"nop","\n","ev",{"VAR?":"sawYourGrandma"},"/ev",[{"->":".^.b","c":true},{"b":["^ - Really? That's great, I'm sure he was very happy to see you. Thanks for bringing everything",{"->":".^.^.^.26"},null]}],"nop","\n","ev",{"VAR?":"sawYourGrandma"},"!","/ev",[{"->":".^.b","c":true},{"b":["^ - Here you go, mom, I got everything on the list.",{"->":".^.^.^.33"},null]}],"nop","\n","ev",{"VAR?":"sawYourGrandma"},"!","/ev",[{"->":".^.b","c":true},{"b":["^ - Thanks honey, put it there. There is still some time left until dinner - Said his mother.",{"->":".^.^.^.40"},null]}],"nop","\n","ev","str","^LivingRoom","/str",{"x()":"ChangeBackground","exArgs":1},"out","/ev","\n","^John went to the living room, he wanted to rest a little before dinner and didn't want to go back to his room. His father was just arriving, he still didn't know where he had gone, maybe he bought some last minute gifts? Possibly John had inherited that from his father.","\n","^A few minutes passed, and he heard a car noise, then someone opened the door. It was her father, unfortunately he didn't bring any gifts, perhaps he had left them in the car.","\n",["^Hey champ! - His father greeted him cheerfully","\n","^John greeted him with a wave. - Did you bring presents?","\n",["^You know, no presents until tomorrow John","\n","ev",{"VAR?":"helpedTheGirl"},"/ev",[{"->":".^.b","c":true},{"b":["^ but I have a very good news - His father seemed happy. ",{"->":".^.^.^.6"},null]}],"nop","\n","ev",{"VAR?":"helpedTheGirl"},"/ev",[{"->":".^.b","c":true},{"b":["^- What is it about? - Said John, his father called John's mother, gathering them in the living room.",{"->":".^.^.^.12"},null]}],"nop","\n","ev",{"VAR?":"helpedTheGirl"},"/ev",[{"->":".^.b","c":true},{"b":["^ I got a call from work, it looks like they won't need to transfer me.",{"->":".^.^.^.18"},null]}],"nop","\n","ev",{"VAR?":"helpedTheGirl"},"/ev",[{"->":".^.b","c":true},{"b":["^ Are you for real, honey? That's great! But why? - said John's mother, liking the idea of staying.",{"->":".^.^.^.24"},null]}],"nop","\n","ev",{"VAR?":"helpedTheGirl"},"/ev",[{"->":".^.b","c":true},{"b":["^ It seems that a girl is going to replace the transfer, she had a meeting today with my bosses, and she was very interested. They called me to ask if I wanted the transfer, but I decided it was best for us to stay here - said John's father, happy about that.",{"->":".^.^.^.30"},null]}],"nop","\n","ev",{"VAR?":"helpedTheGirl"},"/ev",[{"->":".^.b","c":true},{"b":["^ John's mother hugged her husband, happy about the decision to stay. They opened the embrace, looking for John to join them, he hugged them and even though he didn't mind moving he was also happy for the news, he knew it was important for his mother.",{"->":".^.^.^.36"},null]}],"nop","\n",["^Well, dinner is done, so who's hungry?","\n","ev","str","^Black","/str",{"x()":"ChangeBackground","exArgs":1},"out","/ev","\n","^They spent the whole dinner talking, it was strange for John. He hardly saw his parents and hadn't talked to them like this in a long time. John was telling about his way to the store, his meeting with the girl with the matches, the snowball kids...","\n","^By the time he realized they had finished dinner, John was tired, so he wished his parents a good night and went upstairs to his room.","\n","ev",{"VAR?":"helpedTheGirl"},"!",{"VAR?":"helpedTheHomeless"},"!","&&",{"VAR?":"buyiedMatchess"},"!","&&",{"VAR?":"sawYourGrandma"},"!","&&",{"VAR?":"playedWithKids"},"!","&&","/ev",[{"->":".^.b","c":true},{"b":["\n",{"->":"BadEnd"},{"->":".^.^.^.31"},null]}],"nop","\n",{"->":"GoodEnd"},{"#f":5,"#n":"g-2"}],{"#f":5,"#n":"g-1"}],{"#f":5,"#n":"g-0"}],null],{"#f":1}],"BadEnd":["ev","str","^JohnsRoom","/str",{"x()":"ChangeBackground","exArgs":1},"out","/ev","\n","^John lay down on the bed. He thought about the day, about the people who had asked for his help. He didn't help anyone, he didn't even go to his grandmother's house...","\n","^Was John a bad person? Was he hiding behind his social anxiety, not to help anyone? Was he sabotaging himself?","\n","^With that attitude he would end badly, he knew it, but no matter how hard he tried he couldn't change. He had had so many opportunities today.... He could have taken the step, changed, but he had not done it. It hurt him to have been so selfish, he felt bad.","\n","^It was time to change, from now on he would try harder. To make friends, to help people in need, to take care of her family... Yes, he was determined","\n","^He would be a better person.","\n","end",{"#f":1}],"GoodEnd":["ev","str","^JohnsRoom","/str",{"x()":"ChangeBackground","exArgs":1},"out","/ev","\n","^John lay down on the bed. He thought about the day, about the people who had asked for his help.","\n","ev",{"VAR?":"helpedTheGirl"},"/ev",[{"->":".^.b","c":true},{"b":["^ He had helped that girl, the one with the umbrella. She said she was going to an important meeting, was she...? No, it would be too much of a coincidence, but he was happy to have helped her, even though now he didn't have an umbrella.",{"->":".^.^.^.14"},null]}],"nop","\n","ev",{"VAR?":"helpedTheHomeless"},"/ev",[{"->":".^.b","c":true},{"b":["^ He gave food to the homeless man, who appreciated it much more than if he had given him a couple of coins. John was happy for that, but he was also thankful that he had helped the homeless man because for him, he bought the board game that he would spend time with his parents.",{"->":".^.^.^.20"},null]}],"nop","\n","ev",{"VAR?":"buyiedMatchess"},"/ev",[{"->":".^.b","c":true},{"b":["^ John took out the box of matches, the girl seemed very happy to have sold even one box. ",{"->":".^.^.^.26"},null]}],"nop","\n","ev",{"VAR?":"sawYourGrandma"},"/ev",[{"->":".^.b","c":true},{"b":["^ He was grateful to have seen his grandmother, it had been a long time since he had seen her and being with her reminded him how important it is to take care of his family.",{"->":".^.^.^.32"},null]}],"nop","\n","ev",{"VAR?":"playedWithKids"},"/ev",[{"->":".^.b","c":true},{"b":["^ John ran his hands over his head, remembering when the boys hit him with a snowball. At first, he was angry because he thought they were messing with him, but they just wanted to play. Now he had someone to be with in class, and that made him very happy.",{"->":".^.^.^.38"},null]}],"nop","\n","^It seems that having helped all those people made him happy too, he had never thought about it, he was always selfish and only thought of himself. He believed that everyone was the same, but no, if he could help all those people, surely there are more good people out there giving support to others when necessary. John decided that from now on he would be that kind of person, someone to trust, someone who would not hesitate to help others. He would think more of others, of his family.","\n","^John was happy, the room no longer seemed like a cell","\n","end",{"#f":1}],"global decl":["ev",false,{"VAR=":"rudeToYourMother"},false,{"VAR=":"helpedTheGirl"},false,{"VAR=":"helpedTheHomeless"},false,{"VAR=":"buyiedMatchess"},false,{"VAR=":"sawYourGrandma"},false,{"VAR=":"helpedGrandma"},false,{"VAR=":"playedWithKids"},"/ev","end",null],"#f":1}],"listDefs":{}}